---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyDataSettings.ExportDefaults
source: html/37e75308-01c8-5b08-e2f7-34eb199d9e59.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.ExportDefaults Property

Use for detailed model GreenBuildingXML export.
 When this setting is true, all building and space defaults, schedules, and constructions will be exported to GreenBuildingXML.
 When this setting is false, only values that are specified on the zone or space will be exported to GreenBuildingXML.

## Syntax (C#)
```csharp
public bool ExportDefaults { get; set; }
```